INSERT INTO wise_task_plugin.plugin(id, name, category, description, plugin_type, is_internal, author_id, bean_name)
VALUES ('8ffcc670-0340-47ca-be34-ada5de6fef4b', 'Количество вершин в графе', 'Служебная', 'Количество вершин в графе',
        'GRAPH_CHARACTERISTIC', TRUE, '00000000-0000-0000-0000-000000000000', 'vertexCount'),

       ('0e8990b4-5653-414c-b405-18b7ccbde797', 'Количество ребер в графе', 'Служебная', 'Количество ребер в графе',
        'GRAPH_CHARACTERISTIC', TRUE, '00000000-0000-0000-0000-000000000000', 'edgeCount'),

       ('bfea99b2-d563-48ba-84b8-fee153471aac', 'Дефицита Берже', 'Служебная', 'Дефицита Берже', 
       'GRAPH_CHARACTERISTIC', TRUE, '00000000-0000-0000-0000-000000000000', 'bergeDeficite'),

       ('8614cb5b-602c-478c-822e-dbd47883040b', 'Разделяющие множества', 'Служебная', 'Разделяющие множества', 
       'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'сheckDivSet'),

       ('1e3f09b5-ebce-45e9-9570-b8cca5b2931a', 'Хроматическое число графа равно двум', 'Служебная', 'Хроматическое число графа равно двум',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'сhromaticNumber2'),

       ('ab4665fd-c44a-47b5-89e8-2c046a34a260', 'Правильная вершинная раскраска графа', 'Служебная', 'Правильная вершинная раскраска графа',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'CorrectnessOfVertexColoring'),

       ('138aceb0-fd1e-46b5-88fc-f112ed67bfe9', 'Степени всех вершин графа четные', 'Служебная', 'Степени всех вершин графа четные',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'degVertEven'),

       ('20a7830f-dcae-4e40-92cb-fa44896c3a2e', 'Фактор-критический граф', 'Служебная', 'Фактор-критический граф',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'factorCritical'),

       ('2eadaa96-1e0f-45c9-ad5e-7a7890dbaa1e', 'Поиск подграфа куба', 'Служебная', 'Поиск подграфа куба',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'findCube'),

       ('ff1dd2ca-9f01-4ea5-a6c9-7d2ea5ff7f24', 'Стягивание к K5', 'Служебная', 'Стягивание к K5',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'isK5AfterContraction'),

       ('e7b2798d-d3b2-4788-a6eb-ebbe0bbbff62', 'Граф 2-критический', 'Служебная', 'Граф 2-критический',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'isTwoCritical'),

       ('c66a8e8c-034b-444a-829a-af33f3d74a50', 'Граф - колесо', 'Служебная', 'Граф - колесо',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'isWheel'),

       ('01a5aa1f-e493-4b8b-9be9-9e9689a8aa9b', 'k-factor', 'Служебная', 'k-factor',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'kFactor'),

       ('1f7d2ba7-983f-41f9-b3f1-c286d051305c', 'Окружение графа', 'Служебная', 'Окружение графа',
        'GRAPH_CHARACTERISTIC', TRUE, '00000000-0000-0000-0000-000000000000', 'largestCycle'),

       ('f856a74e-8601-4a82-97fa-68bd3e04861a', 'Максимальное паросочетание в графе', 'Служебная', 'Максимальное паросочетание в графе',
        'GRAPH_CHARACTERISTIC', TRUE, '00000000-0000-0000-0000-000000000000', 'maximalMatching'),

       ('61fe2c5c-512d-407a-b566-04dbf2fe246e', 'Проверка, является ли сумма степеней двух любых вершин графа больше или равна числу вершин графа', 'Служебная', 'Проверка, является ли сумма степеней двух любых вершин графа больше или равна числу вершин графа',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'sumDegIsMoreOrEqVertexCount'),

       ('0ea33694-c3b4-4c4e-b2bc-6287a9027f50', 'Сумма степеней двух любых вершин графа больше или равна числу вершин графа, уменьшенному на единицу', 'Служебная', 'Сумма степеней двух любых вершин графа больше или равна числу вершин графа, уменьшенному на единицу',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'sumDegVerGeqNumVer1'),

       ('aea1bbb3-f27b-4444-a627-353545e5d606', 'Транзитивное замыкание', 'Служебная', 'Транзитивное замыкание',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'transitiveClosure'),

       ('b37d7aea-14fc-4062-9d36-83e23d547e97', 'Транзитивное сокращение', 'Служебная', 'Проверяет, является ли выделенный подграф транзитивным сокращением.',
        'GRAPH_PROPERTY', TRUE, '00000000-0000-0000-0000-000000000000', 'transitiveReduction');
